In [1]:
# Missing Data if you have a missing point pandas will automatically fill  a null value or fill in the missing value

In [2]:
import numpy as np
import pandas as pd

In [3]:
d= {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]} # np.nan signifies a missing or a null value

In [4]:
df = pd.DataFrame(d)

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.dropna() # drapna() drops the rows that has any missing values in it

     A    B  C
0  1.0  5.0  1

In [10]:
df.dropna(axis=1) #axis=1 is going to drop any columns of null values

   C
0  1
1  2
2  3

In [16]:
# you can specify a threshold for this example it can  row 1 b/c it has two non-values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [17]:
#Now lets replace those msiing values
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.fillna(value='') # you can fill the value by the Mean of the column

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [27]:
var = df['A'].fillna(value=df['A'].mean()) # this filly the value by the mean of the value

In [28]:
var

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64